Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/MCTRL/src/Ifx_MAS_Modulator_F16.c
/*
 * Copyright (c) 2024 Infineon Technologies AG. All Rights Reserved.
 *
 * Use of this file is subject to the terms of use agreed between (i) you or the company in which ordinary course of
 * business you are acting and (ii) Infineon Technologies AG, its affiliates or its licensees. If and as long as no
 * such terms of use are agreed, use of this file is subject to the Evaluation Software License Agreement distributed
 * along with this file within the software delivery package.
 *
 */

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "Ifx_MAS_Modulator_F16.h"
#include "Ifx_MAS_Modulator_F16_Cfg.h"

/* C library */
#include "stddef.h"

/* Math library */
#include "Ifx_Math_Arithmetic_F16.h"

/* CMSIS includes */
#include "cmsis_compiler.h"

/******************************************************************************/
/*-----------------------------------Macros-----------------------------------*/
/******************************************************************************/
/* Maximum index of the lookup table used, 2^(size) -1  */
#if IFX_MAS_MODULATOR_F16_CFG_TABLESIN60SQRT3_LUT_SIZE == 10
#define IFX_MAS_MODULATOR_F16_TABLESIN60SQRT3_MAX_INDEX (1023U)
#elif IFX_MAS_MODULATOR_F16_CFG_TABLESIN60SQRT3_LUT_SIZE == 12
#define IFX_MAS_MODULATOR_F16_TABLESIN60SQRT3_MAX_INDEX (4095U)
#endif

/* Macro to convert angle value to lookup table index */
#define IFX_MAS_MODULATOR_F16_ANGLE_TO_INDEX            (15U - IFX_MAS_MODULATOR_F16_CFG_TABLESIN60SQRT3_LUT_SIZE)

/* Modulation index max for linear region, normalized by 2/pi */
#define IFX_MAS_MODULATOR_F16_CONST_MI_0907_Q15         (18921)

/* Ratio from period ticks to compare value */
#define IFX_MAS_MODULATOR_F16_MAX_COMPARE_VALUE_RATIO   (2)
#define IFX_MAS_MODULATOR_F16_MED_COMPARE_VALUE_RATIO   (4)

/* Macros to detect individual faults */
#define IFX_MAS_MODULATOR_F16_MAXAMPLITUDE_FAULT_STS    (0x20U)
#define IFX_MAS_MODULATOR_F16_OVERMODULATION_FAULT_STS  (0x40U)

/* Minimum trigger time */
#define IFX_MAS_MODULATOR_F16_MIN_TRIGGER_TIME          (2U)

/* Macros to define the component ID */
#define IFX_MAS_MODULATOR_F16_COMPONENTID_SOURCEID      ((uint8_t)Ifx_ComponentID_SourceID_infineonTechnologiesAG)
#define IFX_MAS_MODULATOR_F16_COMPONENTID_LIBRARYID     ((uint16_t)Ifx_ComponentID_LibraryID_mctrlActuatorSensor)
#define IFX_MAS_MODULATOR_F16_COMPONENTID_MODULEID      (0U)
#define IFX_MAS_MODULATOR_F16_COMPONENTID_COMPONENTID1  (1U)

#define IFX_MAS_MODULATOR_F16_COMPONENTID_COMPONENTID2  ((uint8_t)Ifx_ComponentID_ComponentID2_basic)

/* Macros to define the component version */
#define IFX_MAS_MODULATOR_F16_COMPONENTVERSION_MAJOR    (2U)
#define IFX_MAS_MODULATOR_F16_COMPONENTVERSION_MINOR    (0U)
#define IFX_MAS_MODULATOR_F16_COMPONENTVERSION_PATCH    (0U)
#define IFX_MAS_MODULATOR_F16_COMPONENTVERSION_T        (4U)
#define IFX_MAS_MODULATOR_F16_COMPONENTVERSION_REV      (0U)

/******************************************************************************/
/*-----------------------Private Function Prototypes--------------------------*/
/******************************************************************************/
/* API to initialize configuration related to current measurement */
static inline void Ifx_MAS_Modulator_F16_initCurrMeasCfg(Ifx_MAS_Modulator_F16* self);

/* API to check the fault status */
static inline bool Ifx_MAS_Modulator_F16_checkFaultStatus(Ifx_MAS_Modulator_F16* self, uint32_t faults);

/* APIs to check the fault status of each fault individually */
static inline bool Ifx_MAS_Modulator_F16_maxAmplitudeFaultStatus(Ifx_MAS_Modulator_F16* self, bool* faultStatusRet,
                                                                 uint32_t faults);
static inline bool Ifx_MAS_Modulator_F16_overmodulationFaultStatus(Ifx_MAS_Modulator_F16* self, bool* faultStatusRet,
                                                                   uint32_t faults);

/* API to set the compare values and triggers */
static inline void Ifx_MAS_Modulator_F16_setActiveShort(Ifx_MAS_Modulator_F16* self, int16_t cmprValues);

/* API to check and limit the inputs */
static inline uint8_t Ifx_MAS_Modulator_F16_limitInputs(Ifx_MAS_Modulator_F16* self, Ifx_Math_Fract16 refVoltageAmp,
                                                        Ifx_Math_Fract16 dcLinkVoltage,
                                                        Ifx_Math_Fract16* voltageOverDcLinkVoltage);

/* API to calculate compare values based on symmetric switching */
static inline void Ifx_MAS_Modulator_F16_symmetricSwitching(int16_t* cmprVal, int16_t* switchingTimes, uint8_t
                                                            sector);

#if IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK != 0

/* API to modify the switching times to get a minimum sensing time (minimum on time feature active) */
static inline void Ifx_MAS_Modulator_F16_modSwitch(Ifx_MAS_Modulator_F16* self, int16_t* compVal,
                                                   int16_t* switchingTimes, uint8_t isSevenSegment);
#else

/* API to modify the switching times to get a minimum sensing time (minimum on time feature inactive) */
static inline void Ifx_MAS_Modulator_F16_modSwitch(Ifx_MAS_Modulator_F16* self, int16_t* compVal,
                                                   int16_t* switchingTimes);
#endif /* IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK != 0 */
/* API to limit the switching times */
static inline void Ifx_MAS_Modulator_F16_limitSwitchTimes(Ifx_MAS_Modulator_F16* self, int16_t* cmprVal);

/* API to calculate the triggers based on sector */
static inline void Ifx_MAS_Modulator_F16_calcTriggers(Ifx_MAS_Modulator_F16* self, int16_t* cmprVal);

/* API to set the triggers for current measurement */
static inline void Ifx_MAS_Modulator_F16_measBegin(Ifx_MAS_Modulator_F16* self, int16_t* cmprVal);

