Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/MCTRL/src/Ifx_MAS_Modulator_F16.c
/* API to assign the compare values and triggers */
static inline void Ifx_MAS_Modulator_F16_assignOutputs(Ifx_MAS_Modulator_F16* self, int16_t* cmprVal);

/* API to calculate the effective times of the inverter switching states */
static inline void Ifx_MAS_Modulator_F16_updatePolar7SegQ16(Ifx_MAS_Modulator_F16* self, uint32_t angle,
                                                            Ifx_Math_Fract16 voltageOverDcLinkVoltage);

/* API to calculate the 7 segment switching times based on t_R, t_L, t_0, and sector */
static inline void Ifx_MAS_Modulator_F16_calcSwitchTimes(Ifx_MAS_Modulator_F16* self, int16_t* switchingTimes,
                                                         Ifx_Math_Fract16 voltageOverDcLinkVoltage);

#if IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK != 0

/* API to set the triggers for current measurement */
static inline uint8_t Ifx_MAS_Modulator_F16_checkMinOnTime(Ifx_MAS_Modulator_F16* self, int16_t* cmprVal);

#endif /* IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK */
/* API to modify the switching times at low amplitudes */
static inline void Ifx_MAS_Modulator_F16_modSwitchSmallAmplitude(Ifx_MAS_Modulator_F16* self,
                                                                 int16_t              * cmprVal);
static inline void Ifx_MAS_Modulator_F16_measEnd(Ifx_MAS_Modulator_F16* self,
                                                 int16_t              * cmprVal);
static inline Ifx_MAS_Modulator_F16_State Ifx_MAS_Modulator_F16_stateOff(Ifx_MAS_Modulator_F16* self, bool
                                                                         enterFaultState);
static inline Ifx_MAS_Modulator_F16_State Ifx_MAS_Modulator_F16_stateOn(Ifx_MAS_Modulator_F16* self, bool
                                                                        enterFaultState, uint32_t angle,
                                                                        Ifx_Math_Fract16 voltageOverDcLinkVoltage);
static inline Ifx_MAS_Modulator_F16_State Ifx_MAS_Modulator_F16_stateBrake(Ifx_MAS_Modulator_F16* self, bool
                                                                           enterFaultState);
static inline Ifx_MAS_Modulator_F16_State Ifx_MAS_Modulator_F16_stateFault(Ifx_MAS_Modulator_F16* self);

/******************************************************************************/
/*------------------------Private Variables/Constants-------------------------*/
/******************************************************************************/
/* *INDENT-OFF* */
/* Component ID */
static const Ifx_ComponentID      Ifx_MAS_Modulator_F16_componentID = {
    .sourceID     = IFX_MAS_MODULATOR_F16_COMPONENTID_SOURCEID,
    .libraryID    = IFX_MAS_MODULATOR_F16_COMPONENTID_LIBRARYID,
    .moduleID     = IFX_MAS_MODULATOR_F16_COMPONENTID_MODULEID,
    .componentID1 = IFX_MAS_MODULATOR_F16_COMPONENTID_COMPONENTID1,
    .componentID2 = IFX_MAS_MODULATOR_F16_COMPONENTID_COMPONENTID2,
};

/* Component Version */
static const Ifx_ComponentVersion Ifx_MAS_Modulator_F16_componentVersion = {
    .major = IFX_MAS_MODULATOR_F16_COMPONENTVERSION_MAJOR,
    .minor = IFX_MAS_MODULATOR_F16_COMPONENTVERSION_MINOR,
    .patch = IFX_MAS_MODULATOR_F16_COMPONENTVERSION_PATCH,
    .t     = IFX_MAS_MODULATOR_F16_COMPONENTVERSION_T,
    .rev   = IFX_MAS_MODULATOR_F16_COMPONENTVERSION_REV
};

/******************************************************************************/
/*-----------------------Exported Variables/Constants-------------------------*/
/******************************************************************************/
/* temporary solution, XML_VERSION indicates if static cfg is generated by cfgwiz */
#ifdef IFX_MAS_MODULATOR_F16_CFG_XML_VERSION
/* Default parameters initialized with CfgWizard defines */
Ifx_MAS_Modulator_F16_Param Ifx_MAS_Modulator_F16_g_defaultParam =
{
    .measurementTime_tick                  = IFX_MAS_MODULATOR_F16_CFG_MEASUREMENTTIME_TICK,
    .deadTime_tick                         = IFX_MAS_MODULATOR_F16_CFG_DEADTIME_TICK,
    .driverDelay_tick                      = IFX_MAS_MODULATOR_F16_CFG_DRIVERDELAY_TICK,
    .ringingTime_tick                      = IFX_MAS_MODULATOR_F16_CFG_RINGINGTIME_TICK,
    .period_tick                           = IFX_MAS_MODULATOR_F16_CFG_PERIOD_TICK,
    .measurementPoint                      =
    (Ifx_MAS_Modulator_F16_measurementPoint)IFX_MAS_MODULATOR_F16_CFG_MEASUREMENTPOINT,
    .maxAmplitudeQ15                       = IFX_MAS_MODULATOR_F16_CFG_MAX_AMPLITUDE_Q15,
    .biDirectionalShiftingThresholdHighQ15 = IFX_MAS_MODULATOR_F16_CFG_BI_DIRECTIONAL_SHIFTING_THRESHOLD_HIGH_Q15,
    .biDirectionalShiftingThresholdLowQ15  = IFX_MAS_MODULATOR_F16_CFG_BI_DIRECTIONAL_SHIFTING_THRESHOLD_LOW_Q15
};
#endif
/* *INDENT-ON* */
/******************************************************************************/
/*-------------------------Function Implementations---------------------------*/
/******************************************************************************/
/* Function to get the component ID */
void Ifx_MAS_Modulator_F16_getID(const Ifx_ComponentID** componentID)
{
    *componentID = &Ifx_MAS_Modulator_F16_componentID;
}


/* Function to get the component version */
void Ifx_MAS_Modulator_F16_getVersion(const Ifx_ComponentVersion** componentVersion)
{
    *componentVersion = &Ifx_MAS_Modulator_F16_componentVersion;
}


void Ifx_MAS_Modulator_F16_init(Ifx_MAS_Modulator_F16* self, Ifx_MAS_Modulator_F16_Param* param)
{
    /* Initialize pointer to parameter structure */
    self->param = param;

    /* Copy to avoid a pointer dereference every time the period tick is accessed to improve execution time */
    self->period_tick = self->param->period_tick;

    /* Active low and trigs to default */
    Ifx_MAS_Modulator_F16_setActiveShort(self, self->period_tick);

    /* Set the state machine to INIT */
    self->p_status.state              = Ifx_MAS_Modulator_F16_State_init;
    self->p_status.maxAmplitudeFlag   = false;
    self->p_status.overmodulationFlag = false;

    /* Disable module */
    Ifx_MAS_Modulator_F16_enable(self, false);

    /* Initialize current measurement configuration */
    Ifx_MAS_Modulator_F16_initCurrMeasCfg(self);

    /* Minimum sensing time */
    Ifx_MAS_Modulator_F16_p_recalculateMinSenseTime(self);

