Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/MCTRL/src/Ifx_MAS_Modulator_F16.c
    /* Initialize internal variables */
    self->p_clearFault = false;

    /* Set flag for second trigger */
    self->p_output.currentReconstructionInfo.secondTriggerIsSum = true;

    /* Set substate to bidirectional two phase shift */
    self->p_status.subState = Ifx_MAS_Modulator_F16_SubState_bidirectionalTwoPhase;

    /* Minimum on time */
    self->p_minTurnOnTimeHalf_tick = (IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK + self->param->deadTime_tick) / 2;

    /* Disable brake */
    self->p_enableBrake = false;
}


static inline void Ifx_MAS_Modulator_F16_initCurrMeasCfg(Ifx_MAS_Modulator_F16* self)
{
    /* Delta to be added if measuring from the beginning */
    Ifx_MAS_Modulator_F16_p_recalculateDeltaBegin(self);

    /* Delta to be subtracted if measuring from the end */
    Ifx_MAS_Modulator_F16_p_recalculateDeltaEnd(self);
}


static inline bool Ifx_MAS_Modulator_F16_checkFaultStatus(Ifx_MAS_Modulator_F16* self, uint32_t faults)
{
    /* boolean output fault status initialized to false */
    bool faultStatusRet = false;

    /* Check if any fault occurred */
    if (faults != 0u)
    {
        /* 1. check for maximum amplitude */
        self->p_status.maxAmplitudeFlag = Ifx_MAS_Modulator_F16_maxAmplitudeFaultStatus(self, &faultStatusRet,
            faults);

        /* 2. check for overmodulation */
        self->p_status.overmodulationFlag = Ifx_MAS_Modulator_F16_overmodulationFaultStatus(self, &faultStatusRet,
            faults);
    }

    /* Check if a fault clear request was placed */
    else if (self->p_clearFault == true)
    {
        /* Clear all faults in status in case a fault clear request was done */
        self->p_status.maxAmplitudeFlag   = false;
        self->p_status.overmodulationFlag = false;
    }
    else
    {
        /* Final else-clause */
    }

    /* return the fault status */
    return faultStatusRet;
}


static inline bool Ifx_MAS_Modulator_F16_maxAmplitudeFaultStatus(Ifx_MAS_Modulator_F16* self, bool* faultStatusRet,
                                                                 uint32_t faults)
{
    /* Variable to store the max. amplitude fault status */
    bool faultMaxAmplitude = self->p_status.maxAmplitudeFlag;

    /* 1. check individually for maximum amplitude */
    /* 1.1 Check if this fault is configured as ENABLED */
#if IFX_MAS_MODULATOR_F16_CFG_FAULT_REACTION_MAX_AMPLITUDE >= IFX_MAS_MODULATOR_F16_FAULT_REACTION_ENABLE

    if ((faults & IFX_MAS_MODULATOR_F16_MAXAMPLITUDE_FAULT_STS) != 0)
    {
        /* Set the fault information status bit */
        faultMaxAmplitude = true;

        /* 1.2 Check if this fault is configured for REPORTING */
#if IFX_MAS_MODULATOR_F16_CFG_FAULT_REACTION_MAX_AMPLITUDE >= IFX_MAS_MODULATOR_F16_FAULT_REACTION_REPORT_ONLY

#if (IFX_MAS_MODULATOR_F16_CFG_ENABLE_FAULT_OUT == 1)

        /* report fault source ONLY the 1st time it occurs */
        if (self->p_status.maxAmplitudeFlag == false)
        {
            /* report the fault through the user interface */
            IFX_MAS_MODULATOR_F16_CFG_FAULT_OUT();
        }

#endif

        /* 1.3 Check if this fault is configured for REACTION */
#if IFX_MAS_MODULATOR_F16_CFG_FAULT_REACTION_MAX_AMPLITUDE >= IFX_MAS_MODULATOR_F16_FAULT_REACTION_REPORT_REACT

        /* set the fault status for reacting */
        *faultStatusRet = true;
#endif
#endif
    }

#endif

    return faultMaxAmplitude;
}


static inline bool Ifx_MAS_Modulator_F16_overmodulationFaultStatus(Ifx_MAS_Modulator_F16* self, bool* faultStatusRet,
                                                                   uint32_t faults)
{
    /* Variable to store the max. amplitude fault status */
    bool faultOvermodulation = self->p_status.overmodulationFlag;

    /* 2 check individually for Overmodulation */
    /* 2.1 Check if this fault is configured as ENABLED */
#if IFX_MAS_MODULATOR_F16_CFG_FAULT_REACTION_OVERMODULATION >= IFX_MAS_MODULATOR_F16_FAULT_REACTION_ENABLE

    if ((faults & IFX_MAS_MODULATOR_F16_OVERMODULATION_FAULT_STS) != 0)
    {
        /* set the fault information status bit */
        faultOvermodulation = true;

#if IFX_MAS_MODULATOR_F16_CFG_FAULT_REACTION_OVERMODULATION >= IFX_MAS_MODULATOR_F16_FAULT_REACTION_REPORT_ONLY

#if (IFX_MAS_MODULATOR_F16_CFG_ENABLE_FAULT_OUT == 1)

        /* report fault source ONLY the 1st time it occurs */
        if (self->p_status.overmodulationFlag == false)
        {
            /* report the fault through the user interface */
            IFX_MAS_MODULATOR_F16_CFG_FAULT_OUT();
        }

#endif

        /* 2.3 Check if this fault is configured for REACTION */
#if IFX_MAS_MODULATOR_F16_CFG_FAULT_REACTION_OVERMODULATION >= IFX_MAS_MODULATOR_F16_FAULT_REACTION_REPORT_REACT

        /* set the fault status for reacting */
        *faultStatusRet = true;
#endif
#endif
    }

#endif

    return faultOvermodulation;
}


/* polyspace-begin CODE-METRIC:CALLING [Justified:Low] "This is a common function expected to be called multiple times."
 * */
static inline void Ifx_MAS_Modulator_F16_setActiveShort(Ifx_MAS_Modulator_F16* self, int16_t cmprValues)
{
    /* Set the compare up values */
    self->p_output.compareValues_tick[0] = (uint16_t)cmprValues;
    self->p_output.compareValues_tick[1] = (uint16_t)cmprValues;
    self->p_output.compareValues_tick[2] = (uint16_t)cmprValues;

    /* Set the compare down values */
    int16_t downCompareValue = self->period_tick - cmprValues;
    self->p_output.compareValues_tick[3] = (uint16_t)downCompareValue;
    self->p_output.compareValues_tick[4] = (uint16_t)downCompareValue;
    self->p_output.compareValues_tick[5] = (uint16_t)downCompareValue;

    /* Set the current triggers */
    self->p_output.triggerTime_tick[0] = IFX_MAS_MODULATOR_F16_MIN_TRIGGER_TIME;
    self->p_output.triggerTime_tick[1] = (uint16_t)self->period_tick / IFX_MAS_MODULATOR_F16_MAX_COMPARE_VALUE_RATIO;
}


/* polyspace-end CODE-METRIC:CALLING [Justified:Low] "This is a common function expected to be called multiple times."
 * */
void Ifx_MAS_Modulator_F16_execute(Ifx_MAS_Modulator_F16* self, Ifx_Math_PolarFract16 refVoltage, Ifx_Math_Fract16
                                   dcLinkVoltageQ15)
{
    /* Stores the occurred faults */
    uint8_t                     faultStatus;

