Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/MCTRL/src/Ifx_MAS_Modulator_F16.c
    /* Stores if the state machine will be set to false */
    bool                        enterFaultState;

    /* Variable to store the state */
    Ifx_MAS_Modulator_F16_State previousState = (self->p_status.state);
    Ifx_MAS_Modulator_F16_State nextState     = previousState;

    /* Stores the ratio between amplitude of needed voltage and dc voltage */
    Ifx_Math_Fract16            voltageOverDcLinkVoltage;

    /* Limit the inputs and check if any fault occurred */
    faultStatus = Ifx_MAS_Modulator_F16_limitInputs(self, refVoltage.amplitude, dcLinkVoltageQ15,
        &voltageOverDcLinkVoltage);

    /* Update the actual output voltage angle to the ref. voltage angle */
    self->p_output.actualVoltage.angle = refVoltage.angle;

    /* Check fault configuration and return if state machine will be set to false */
    enterFaultState = Ifx_MAS_Modulator_F16_checkFaultStatus(self, faultStatus);

    /* Handles the state machine */
    switch (previousState)
    {
        /* Initialize the module */
        case Ifx_MAS_Modulator_F16_State_init:

            /* do state transition to OFF at the 1st state machine execution cycle */
            nextState = Ifx_MAS_Modulator_F16_State_off;
            break;

        /* Modulator not running */
        case Ifx_MAS_Modulator_F16_State_off:

            /* Call API when state is in off */
            nextState = Ifx_MAS_Modulator_F16_stateOff(self, enterFaultState);
            break;

        /* Modulator running */
        case Ifx_MAS_Modulator_F16_State_on:
            nextState = Ifx_MAS_Modulator_F16_stateOn(self, enterFaultState, refVoltage.angle,
                voltageOverDcLinkVoltage);
            break;

        /* Modulator in fault */
        case Ifx_MAS_Modulator_F16_State_fault:

            /* Call API when state is in off */
            nextState = Ifx_MAS_Modulator_F16_stateFault(self);
            break;

        /* Modulator in brake state*/
        case Ifx_MAS_Modulator_F16_State_brake:
            nextState = Ifx_MAS_Modulator_F16_stateBrake(self, enterFaultState);
            break;

        /* Invalid state, transition to init */
        default:

            /* Default transition to INIT */
            nextState = Ifx_MAS_Modulator_F16_State_init;

            /* Active low and trigs to default */
            Ifx_MAS_Modulator_F16_setActiveShort(self, self->period_tick);
            break;
    }

    /* Clear internal clear fault variable */
    self->p_clearFault = false;

    /* Update state */
    self->p_status.state = nextState;
}


static inline uint8_t Ifx_MAS_Modulator_F16_limitInputs(Ifx_MAS_Modulator_F16* self, Ifx_Math_Fract16 refVoltageAmp,
                                                        Ifx_Math_Fract16 dcLinkVoltage,
                                                        Ifx_Math_Fract16* voltageOverDcLinkVoltage)
{
    /* Stores the occurred faults */
    uint8_t          faultStatus = 0;

    /* Stores actual voltage */
    Ifx_Math_Fract16 limitedAmp;
    Ifx_Math_Fract16 modIndex;
    Ifx_Math_Fract16 limModIndex;
    Ifx_Math_Fract16 actualVoltageAmp;

    /* Limit amplitude to the maximum amplitude parameter */
    if (refVoltageAmp > self->param->maxAmplitudeQ15)
    {
        limitedAmp   = self->param->maxAmplitudeQ15;
        faultStatus |= (uint8_t)IFX_MAS_MODULATOR_F16_MAXAMPLITUDE_FAULT_STS;
    }
    else
    {
        limitedAmp = refVoltageAmp;
    }

    /* Calculate the ratio between amplitude of needed voltage and dc voltage */
    modIndex = Ifx_Math_DivShLSatNZ_F16(limitedAmp, dcLinkVoltage, 15u);

    /* Limit modulation index to the Linear Region */
    if (modIndex > IFX_MAS_MODULATOR_F16_CONST_MI_0907_Q15)
    {
        limModIndex  = IFX_MAS_MODULATOR_F16_CONST_MI_0907_Q15;
        faultStatus |= (uint8_t)IFX_MAS_MODULATOR_F16_OVERMODULATION_FAULT_STS;

        /* Write the actual voltage (DC-Link voltage * linear modulation limit) */
        actualVoltageAmp = Ifx_Math_Mul_F16(dcLinkVoltage, IFX_MAS_MODULATOR_F16_CONST_MI_0907_Q15);
    }
    else
    {
        limModIndex      = modIndex;
        actualVoltageAmp = limitedAmp;
    }

    /* Write actual voltage output and modulation index */
    *voltageOverDcLinkVoltage              = limModIndex;
    self->p_output.actualVoltage.amplitude = actualVoltageAmp;

    return faultStatus;
}


static inline Ifx_MAS_Modulator_F16_State Ifx_MAS_Modulator_F16_stateOff(Ifx_MAS_Modulator_F16* self, bool
                                                                         enterFaultState)
{
    Ifx_MAS_Modulator_F16_State nextState;

    /* Transition to FAULT and execute configured software reaction */
    if (enterFaultState == true)
    {
        nextState = Ifx_MAS_Modulator_F16_State_fault;
#if IFX_MAS_MODULATOR_F16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_LOW
        Ifx_MAS_Modulator_F16_setActiveShort(self, self->period_tick);
#elif IFX_MAS_MODULATOR_F16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH
        Ifx_MAS_Modulator_F16_setActiveShort(self, 0);
#elif IFX_MAS_MODULATOR_F16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH_LOW
        Ifx_MAS_Modulator_F16_setActiveShort(self, (self->period_tick /
                                                    IFX_MAS_MODULATOR_F16_MED_COMPARE_VALUE_RATIO));
#endif
    }

    /* Transition to brake and execute configured software reaction */
    else if ((self->p_enableBrake == true)
             && (self->p_enable == true))
    {
        nextState = Ifx_MAS_Modulator_F16_State_brake;
#if IFX_MAS_MODULATOR_F16_CFG_BRAKE_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_LOW
        Ifx_MAS_Modulator_F16_setActiveShort(self, self->period_tick);
#elif IFX_MAS_MODULATOR_F16_CFG_BRAKE_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH
        Ifx_MAS_Modulator_F16_setActiveShort(self, 0);
#elif IFX_MAS_MODULATOR_F16_CFG_BRAKE_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH_LOW
        Ifx_MAS_Modulator_F16_setActiveShort(self, (self->period_tick /
                                                    IFX_MAS_MODULATOR_F16_MED_COMPARE_VALUE_RATIO));
#endif
    }

