Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/MCTRL/src/Ifx_MAS_Modulator_F16.c
    /* Transition to ON if module enabled on the next execution cycle */
    else if (self->p_enable == true)
    {
        nextState = Ifx_MAS_Modulator_F16_State_on;

        /* Set substate to bidirectional two phase shift */
        self->p_status.subState = Ifx_MAS_Modulator_F16_SubState_bidirectionalTwoPhase;
    }
    else
    {
        /* Stay in off */
        nextState = Ifx_MAS_Modulator_F16_State_off;
    }

    return nextState;
}


static inline Ifx_MAS_Modulator_F16_State Ifx_MAS_Modulator_F16_stateOn(Ifx_MAS_Modulator_F16* self, bool
                                                                        enterFaultState, uint32_t angle,
                                                                        Ifx_Math_Fract16 voltageOverDcLinkVoltage)
{
    Ifx_MAS_Modulator_F16_State nextState;

    /* Transition to FAULT and execute configured software reaction */
    if (enterFaultState == true)
    {
        nextState = Ifx_MAS_Modulator_F16_State_fault;
#if IFX_MAS_MODULATOR_F16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_LOW
        Ifx_MAS_Modulator_F16_setActiveShort(self, self->period_tick);
#elif IFX_MAS_MODULATOR_F16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH
        Ifx_MAS_Modulator_F16_setActiveShort(self, 0);
#elif IFX_MAS_MODULATOR_F16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH_LOW
        Ifx_MAS_Modulator_F16_setActiveShort(self, (self->period_tick /
                                                    IFX_MAS_MODULATOR_F16_MED_COMPARE_VALUE_RATIO));
#endif
    }

    /* Transition to brake and execute configured software reaction */
    else if ((self->p_enableBrake == true)
             && (self->p_enable == true))
    {
        /* Set the state to brake */
        nextState = Ifx_MAS_Modulator_F16_State_brake;
#if IFX_MAS_MODULATOR_F16_CFG_BRAKE_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_LOW
        Ifx_MAS_Modulator_F16_setActiveShort(self, self->period_tick);
#elif IFX_MAS_MODULATOR_F16_CFG_BRAKE_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH
        Ifx_MAS_Modulator_F16_setActiveShort(self, 0);
#elif IFX_MAS_MODULATOR_F16_CFG_BRAKE_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH_LOW
        Ifx_MAS_Modulator_F16_setActiveShort(self, (self->period_tick /
                                                    IFX_MAS_MODULATOR_F16_MED_COMPARE_VALUE_RATIO));
#endif
    }

    /* Modulator enabled */
    else if (self->p_enable == true)
    {
        /* Calculate the new compare values */
        Ifx_MAS_Modulator_F16_updatePolar7SegQ16(self, angle, voltageOverDcLinkVoltage);

        /* Set the state to on */
        nextState = Ifx_MAS_Modulator_F16_State_on;
    }
    else

    /* Modulator disabled */
    {
        /* Set the state to OFF */
        nextState = Ifx_MAS_Modulator_F16_State_off;

        /* Active low and trigs to default */
        Ifx_MAS_Modulator_F16_setActiveShort(self, self->period_tick);
    }

    return nextState;
}


static inline Ifx_MAS_Modulator_F16_State Ifx_MAS_Modulator_F16_stateBrake(Ifx_MAS_Modulator_F16* self, bool
                                                                           enterFaultState)
{
    Ifx_MAS_Modulator_F16_State nextState;

    /* Transition to FAULT and execute configured software reaction */
    if (enterFaultState == true)
    {
        nextState = Ifx_MAS_Modulator_F16_State_fault;
#if IFX_MAS_MODULATOR_F16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_LOW
        Ifx_MAS_Modulator_F16_setActiveShort(self, self->period_tick);
#elif IFX_MAS_MODULATOR_F16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH
        Ifx_MAS_Modulator_F16_setActiveShort(self, 0);
#elif IFX_MAS_MODULATOR_F16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATOR_F16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH_LOW
        Ifx_MAS_Modulator_F16_setActiveShort(self, (self->period_tick /
                                                    IFX_MAS_MODULATOR_F16_MED_COMPARE_VALUE_RATIO));
#endif
    }

    /* Transition to OFF and execute configured software reaction */
    else if ((self->p_enableBrake == false)
             && (self->p_enable == false))
    {
        /* do state transition to OFF */
        nextState = Ifx_MAS_Modulator_F16_State_off;

        /* Active low and trigs to default */
        Ifx_MAS_Modulator_F16_setActiveShort(self, self->period_tick);
    }

    /* Transition to ON if module enabled on the next execution cycle */
    else if (self->p_enableBrake == false)
    {
        nextState = Ifx_MAS_Modulator_F16_State_on;

        /* Set substate to bidirectional two phase shift */
        self->p_status.subState = Ifx_MAS_Modulator_F16_SubState_bidirectionalTwoPhase;
    }
    else
    {
        /* stay in brake */
        nextState = Ifx_MAS_Modulator_F16_State_brake;
    }

    return nextState;
}


static inline Ifx_MAS_Modulator_F16_State Ifx_MAS_Modulator_F16_stateFault(Ifx_MAS_Modulator_F16* self)
{
    Ifx_MAS_Modulator_F16_State nextState;

    if (self->p_clearFault == true)
    {
        /* do state transition to OFF */
        nextState = Ifx_MAS_Modulator_F16_State_off;

        /* Active low and trigs to default */
        Ifx_MAS_Modulator_F16_setActiveShort(self, self->period_tick);
    }
    else
    {
        nextState = Ifx_MAS_Modulator_F16_State_fault;
    }

    return nextState;
}


__USED static inline void Ifx_MAS_Modulator_F16_updatePolar7SegQ16(Ifx_MAS_Modulator_F16* self, uint32_t angle,
                                                                   Ifx_Math_Fract16 voltageOverDcLinkVoltage)
{
    /* Sector number [0..5] */
    uint8_t  sector;

    /* Lookup table index */
    uint16_t tableIndex;

    /* Array to store the switching times ={t_Right, t_Left, t_0} */
    int16_t  switchingTimes[3];
    uint32_t angleTimesSix;

    /* Calculate sector number */
    angleTimesSix = (angle >> 17) * 6;
    sector        = (uint8_t)(angleTimesSix >> 15);

    /* Assign sector value */
    self->p_output.currentReconstructionInfo.sector = sector;

    /* Calculate angle in sin lookup table: index [0..4095] */
    tableIndex = (uint16_t)(angleTimesSix >>
                            (IFX_MAS_MODULATOR_F16_ANGLE_TO_INDEX)&IFX_MAS_MODULATOR_F16_TABLESIN60SQRT3_MAX_INDEX);

    /* Get sine and cosine values from the lookup table */
    Ifx_Math_Fract16 sinValue = Ifx_MAS_Modulator_F16_lutSin60Sqrt3[tableIndex];
    Ifx_Math_Fract16 cosValue = Ifx_MAS_Modulator_F16_lutSin60Sqrt3[(IFX_MAS_MODULATOR_F16_TABLESIN60SQRT3_MAX_INDEX -
                                                                     tableIndex)];

    /* Calculate effective switching times, t_R, t_L, and t_0 */
    /* t_Right */
    switchingTimes[0] = Ifx_Math_MulShR_F16((self->period_tick / IFX_MAS_MODULATOR_F16_MAX_COMPARE_VALUE_RATIO),
        Ifx_Math_Mul_F16(voltageOverDcLinkVoltage, cosValue), 14u);

    /* t_Left */
    switchingTimes[1] = Ifx_Math_MulShR_F16((self->period_tick / IFX_MAS_MODULATOR_F16_MAX_COMPARE_VALUE_RATIO),
        Ifx_Math_Mul_F16(voltageOverDcLinkVoltage, sinValue), 14u);

    /* t_0 */
    switchingTimes[2] = ((self->period_tick / IFX_MAS_MODULATOR_F16_MAX_COMPARE_VALUE_RATIO) - switchingTimes[0] -
                         switchingTimes[1]) / 2;
    Ifx_MAS_Modulator_F16_calcSwitchTimes(self, switchingTimes, voltageOverDcLinkVoltage);
}


static inline void Ifx_MAS_Modulator_F16_calcSwitchTimes(Ifx_MAS_Modulator_F16* self, int16_t* switchingTimes,
                                                         Ifx_Math_Fract16 voltageOverDcLinkVoltage)
{
    /* Temporary values to hold the compare values. The array is organized as following:
     * The three phase pulses have different length: long, middle, short.
     * 0 and 3: switch on/off time of the long pulse.
     * 1 and 4: switch on/off time of the middle pulse.
     * 2 and 5: switch on/off time of the short pulse.
     */
    int16_t cmprVal[6];

    /* Calculate compare values based on symmetric switching */
    Ifx_MAS_Modulator_F16_symmetricSwitching(cmprVal, switchingTimes,
        self->p_output.currentReconstructionInfo.sector);

#if IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK != 0

    /* Check the minimum on time and store the modulation mode. Per default the modulator is in 7 segment mode, in case
     * a pulse is
     * eliminated the modulator will be in 5 segment mode. */
    uint8_t isSevenSegment = Ifx_MAS_Modulator_F16_checkMinOnTime(self, cmprVal);
#endif /* IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK */
    /* Assign compare values symmetrically */
    cmprVal[3] = cmprVal[0];
    cmprVal[4] = cmprVal[1];
    cmprVal[5] = cmprVal[2];

#if IFX_MAS_MODULATOR_F16_CFG_CURRENT_MEASUREMENT_TOPOLOGY == 0

    /* Modify the corresponding compare value for the different asymmetric case */
    if ((voltageOverDcLinkVoltage > self->param->biDirectionalShiftingThresholdHighQ15)
        || ((voltageOverDcLinkVoltage > self->param->biDirectionalShiftingThresholdLowQ15)
            && (self->p_status.subState == Ifx_MAS_Modulator_F16_SubState_bidirectionalThreePhase)))
    {
        self->p_status.subState = Ifx_MAS_Modulator_F16_SubState_bidirectionalThreePhase;
#if IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK != 0
        Ifx_MAS_Modulator_F16_modSwitch(self, cmprVal, switchingTimes, isSevenSegment);
#else
        Ifx_MAS_Modulator_F16_modSwitch(self, cmprVal, switchingTimes);
#endif /* IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK */
    }
    else
    {
        self->p_status.subState = Ifx_MAS_Modulator_F16_SubState_bidirectionalTwoPhase;
        Ifx_MAS_Modulator_F16_modSwitchSmallAmplitude(self, cmprVal);
    }

