Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/MCTRL/src/Ifx_MAS_Modulator_F16.c
#endif /* IFX_MAS_MODULATOR_F16_CFG_CURRENT_MEASUREMENT_TOPOLOGY == 0 */
    /* Limit switching times between the defined limits */
    Ifx_MAS_Modulator_F16_limitSwitchTimes(self, cmprVal);

    /* Calculate the triggers based on sector */
    Ifx_MAS_Modulator_F16_calcTriggers(self, cmprVal);

    /* Assign compare values and triggers */
    Ifx_MAS_Modulator_F16_assignOutputs(self, cmprVal);
}


static inline void Ifx_MAS_Modulator_F16_symmetricSwitching(int16_t* cmprVal, int16_t* switchingTimes, uint8_t sector)
{
    if ((sector & 1u) == 1u)
    {
        /* sector 1,3,5 */
        cmprVal[0] = switchingTimes[2];
        cmprVal[1] = switchingTimes[1] + switchingTimes[2];
        cmprVal[2] = switchingTimes[0] + cmprVal[1];
    }
    else
    {
        /* sector 0,2,4 */
        cmprVal[0] = switchingTimes[2];
        cmprVal[1] = switchingTimes[0] + switchingTimes[2];
        cmprVal[2] = switchingTimes[1] + cmprVal[1];
    }
}


#if IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK != 0

/* polyspace-begin CODE-METRIC:VOCF [Justified:Low] "Violation of language scope metric is justified because the second
 * parameter actually points to an array of unique compare values" */
static inline void Ifx_MAS_Modulator_F16_modSwitch(Ifx_MAS_Modulator_F16* self, int16_t* compVal,
                                                   int16_t* switchingTimes, uint8_t isSevenSegment)
#else

/* polyspace-begin CODE-METRIC:VOCF [Justified:Low] "Violation of language scope metric is justified because the second
 * parameter actually points to an array of unique compare values" */
static inline void Ifx_MAS_Modulator_F16_modSwitch(Ifx_MAS_Modulator_F16*self, int16_t*compVal,
                                                   int16_t*switchingTimes)
#endif /* IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK != 0 */
{
    /* Ticks to shift the pulses in order to have a large enough measurement window */
    int16_t shiftValue;

    /* In this mode the second trigger always measures two currents */
    self->p_output.currentReconstructionInfo.secondTriggerIsSum = true;

    /* Is at least one of the measurement windows (tL and/or tR) too small to be measured? */
    if ((switchingTimes[0] < self->p_minSenseTime_tick)
        || (switchingTimes[1] < self->p_minSenseTime_tick))
    {
        /* Calculate the number of ticks by which pulses must be shifted to make the smaller measurement window large
         * enough to enable current measurement
         * Note: shiftValue is negative!*/
        if (switchingTimes[0] < switchingTimes[1])
        {
            shiftValue = switchingTimes[0] - self->p_minSenseTime_tick;
        }
        else
        {
            shiftValue = switchingTimes[1] - self->p_minSenseTime_tick;
        }

        /* Instead of shifting only the middle pulse to the right, it is possible to shift the middle pulse to the right
         * and the large/small pulses to the left by half of the required shift value. This enables current measurement
         * closer to the maximum amplitude. */
        int16_t shiftValueHalfFixed = (int16_t)(shiftValue / 2);

        /* Modify count up (compVal[0...2]) and count down (compVal[3...5]) values:
         * Always shift large pulse half value to the left */
        compVal[0] = compVal[0] + shiftValueHalfFixed;
        compVal[3] = compVal[3] - shiftValueHalfFixed;

#if IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK != 0

        /* The short pulse can only be shifted to the left if it has not already been eliminated by the minimum on time
         * feature.
         * The conditional shift value equals:
         *  - shift value in case of 5 segment mode (short pulse has been eliminated)
         *  - half shift value in case of 7 segment mode */

        /* polyspace +2 MISRA-C3:10.1 [Justified:Low] "Right shift of signed integer is used for better performance and
         * justified since arithmetic shift is supported on all target architectures/compilers." */
        int16_t shiftValueCond = (int16_t)(shiftValue >> isSevenSegment);

        /* Shift middle pulse to the right, full or half depending on minimum on time */
        compVal[1] = compVal[1] - shiftValueCond;
        compVal[4] = compVal[4] + shiftValueCond;

        /* Shift short pulse half value to the left only if it has not been eliminated */
        compVal[2] = compVal[2] + ((int16_t)isSevenSegment * shiftValueCond);
        compVal[5] = compVal[5] - ((int16_t)isSevenSegment * shiftValueCond);

#else

        /* Shift middle pulse half value to the right */
        compVal[1] = compVal[1] - shiftValueHalfFixed;
        compVal[4] = compVal[4] + shiftValueHalfFixed;

        /* Shift short pulse half value to the left */
        compVal[2] = compVal[2] + shiftValueHalfFixed;
        compVal[5] = compVal[5] - shiftValueHalfFixed;

#endif /* IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK != 0 */
    }
}


/* polyspace-end CODE-METRIC:VOCF [Justified:Low] "Language scope code metric is justified because the second
 * parameter actually points to an array of unique compare values" */

/* polyspace-begin CODE-METRIC:VOCF [Justified:Low] "Violation of language scope metric is justified because the second
 * parameter actually points to an array of unique compare values" */
static inline void Ifx_MAS_Modulator_F16_modSwitchSmallAmplitude(Ifx_MAS_Modulator_F16* self, int16_t* cmprVal)
{
    int16_t secondLastCmprVal;
    int16_t lastCmprVal;
    int16_t marginMeasurementWindowLeft;
    int16_t marginMeasurementWindowRight;

    /* Get the margin of the current measurement window for the first measurement trigger */
    marginMeasurementWindowLeft = cmprVal[1] - cmprVal[0] - self->p_minSenseTime_tick;

    /* Shift the long pulse to the left if the window is not enough for a current measurement */
    if (marginMeasurementWindowLeft < 0)
    {
        /* Modify count up */
        cmprVal[0] = cmprVal[0] + marginMeasurementWindowLeft;

        /* Modify count down */
        cmprVal[3] = cmprVal[3] - marginMeasurementWindowLeft;
    }

    /* After the shift of the long pulse, the last switching event could be the fixed pulse or the shift-to-left
     * pulse, find the second last switching event to decide the current measurement window */
    if (cmprVal[3] > cmprVal[4])
    {
        secondLastCmprVal = cmprVal[3];
        lastCmprVal       = cmprVal[4];
    }
    else
    {
        secondLastCmprVal = cmprVal[4];
        lastCmprVal       = cmprVal[3];
    }

