Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/MCTRL/src/Ifx_MAS_Modulator_F16.c
    /* Get the current measurement window for the second measurement trigger */
    marginMeasurementWindowRight = cmprVal[5] - secondLastCmprVal - self->p_minSenseTime_tick;

    /* Shift short pulse to the right if the window is not enough */
    if (marginMeasurementWindowRight < 0)
    {
        /* Find the last compare value, the phase to be shifted right should orient on the last compare value */
        int16_t marginMeasurementWindowRightNew = cmprVal[2] - lastCmprVal + self->p_minSenseTime_tick;

        /* Modify count up */
        cmprVal[2] = cmprVal[2] + marginMeasurementWindowRightNew;

        /* Modify count down */
        cmprVal[5] = cmprVal[5] - marginMeasurementWindowRightNew;

        /* Set the flag that the second trigger measures only one current */
        self->p_output.currentReconstructionInfo.secondTriggerIsSum = false;
    }
    else
    {
        /* Set the flag that the second trigger measure two currents */
        self->p_output.currentReconstructionInfo.secondTriggerIsSum = true;
    }
}


/* polyspace-end CODE-METRIC:VOCF [Justified:Low] "Language scope code metric is justified because the second
 * parameter actually points to an array of unique compare values" */
static inline void Ifx_MAS_Modulator_F16_limitSwitchTimes(Ifx_MAS_Modulator_F16* self, int16_t* cmprVal)
{
    uint8_t i;

    /* Limit compare values */
    for (i = 0; i < 6; i++)
    {
        /* Set input to upper limit */
        if (cmprVal[i] > (self->period_tick / IFX_MAS_MODULATOR_F16_MAX_COMPARE_VALUE_RATIO))
        {
            cmprVal[i] = (self->period_tick / IFX_MAS_MODULATOR_F16_MAX_COMPARE_VALUE_RATIO);
        }

        /* Set input to lower limit */
        else if (cmprVal[i] < 0)
        {
            cmprVal[i] = 0;
        }
        else
        {
            /* Do nothing */
        }
    }
}


static inline void Ifx_MAS_Modulator_F16_calcTriggers(Ifx_MAS_Modulator_F16* self, int16_t* cmprVal)
{
#if IFX_MAS_MODULATOR_F16_CFG_CURRENT_MEASUREMENT_TOPOLOGY == 0

    if (self->param->measurementPoint == Ifx_MAS_Modulator_F16_measurementPoint_beginning)
    {
        /* Measuring from the begin */
        Ifx_MAS_Modulator_F16_measBegin(self, cmprVal);
    }
    else
    {
        /* Measuring from the end */
        Ifx_MAS_Modulator_F16_measEnd(self, cmprVal);
    }

#endif /* IFX_MAS_MODULATOR_F16_CFG_CURRENT_MEASUREMENT_TOPOLOGY == 0 */
}


static inline void Ifx_MAS_Modulator_F16_measBegin(Ifx_MAS_Modulator_F16* self, int16_t* cmprVal)
{
    /* The measurement trigger during up-counting phase */
    self->p_output.triggerTime_tick[0] = (uint16_t)((int16_t)(cmprVal[0] +
                                                              self->p_currentMeasurement.p_deltaBegin_tick));

    /* The measurement trigger during up-counting phase depends on the shifting pattern. */
    if (self->p_output.currentReconstructionInfo.secondTriggerIsSum == true)
    {
        self->p_output.triggerTime_tick[1] = (uint16_t)((int16_t)((int16_t)(self->period_tick - cmprVal[5]) +
                                                                  self->p_currentMeasurement.p_deltaBegin_tick));
    }
    else
    {
        int16_t startingMeasurementWindow = cmprVal[3] < cmprVal[4] ? cmprVal[3] : cmprVal[4];
        self->p_output.triggerTime_tick[1] = (uint16_t)((int16_t)((int16_t)(self->period_tick -
                                                                            startingMeasurementWindow) +
                                                                  self->p_currentMeasurement.p_deltaBegin_tick));
    }
}


static inline void Ifx_MAS_Modulator_F16_measEnd(Ifx_MAS_Modulator_F16* self, int16_t* cmprVal)
{
    /* Temporary variables to hold the deltas */
    int16_t deltaEnd = self->p_currentMeasurement.p_deltaEnd_tick;

    /* Measuring from the beginning up */

    /* If the middle pulse is shifted to the right in bidirectional three phase shifting, the second switching event
     * could be the
     * middle pulse or the short pulse, find the second switching event to decide the current measurement window */
    int16_t endFirstMeasurementWindow = cmprVal[1] < cmprVal[2] ? cmprVal[1] : cmprVal[2];
    self->p_output.triggerTime_tick[0] = (uint16_t)((int16_t)(endFirstMeasurementWindow - deltaEnd));

    /* Measuring from the end down */
    if (self->p_output.currentReconstructionInfo.secondTriggerIsSum == true)
    {
        /* After the shift of the long pulse, the last switching event could be the fixed pulse or the shift-to-left
         * pulse, find the second last switching event to decide the current measurement window */
        int16_t endSecondMeasurementWindow = cmprVal[3] < cmprVal[4] ? cmprVal[4] : cmprVal[3];
        self->p_output.triggerTime_tick[1] = (uint16_t)((int16_t)((int16_t)(self->period_tick -
                                                                            endSecondMeasurementWindow) - deltaEnd));
    }
    else
    {
        self->p_output.triggerTime_tick[1] = (uint16_t)((int16_t)((int16_t)(self->period_tick - cmprVal[5]) -
                                                                  deltaEnd));
    }
}


/* polyspace-begin CODE-METRIC:VOCF [Justified:Low] "For performance reasons, the assignment of the compare values
 * according to the correct sector is implemented as a switch-case" */
static inline void Ifx_MAS_Modulator_F16_assignOutputs(Ifx_MAS_Modulator_F16* self, int16_t* cmprVal)
{
    switch (self->p_output.currentReconstructionInfo.sector)
    {
        case 0:
            self->p_output.compareValues_tick[0] = (uint16_t)cmprVal[0];
            self->p_output.compareValues_tick[1] = (uint16_t)cmprVal[1];
            self->p_output.compareValues_tick[2] = (uint16_t)cmprVal[2];
            self->p_output.compareValues_tick[3] = (uint16_t)((int16_t)(self->period_tick - cmprVal[3]));
            self->p_output.compareValues_tick[4] = (uint16_t)((int16_t)(self->period_tick - cmprVal[4]));
            self->p_output.compareValues_tick[5] = (uint16_t)((int16_t)(self->period_tick - cmprVal[5]));
            break;

        case 1:
            self->p_output.compareValues_tick[1] = (uint16_t)cmprVal[0];
            self->p_output.compareValues_tick[0] = (uint16_t)cmprVal[1];
            self->p_output.compareValues_tick[2] = (uint16_t)cmprVal[2];
            self->p_output.compareValues_tick[4] = (uint16_t)((int16_t)(self->period_tick - cmprVal[3]));
            self->p_output.compareValues_tick[3] = (uint16_t)((int16_t)(self->period_tick - cmprVal[4]));
            self->p_output.compareValues_tick[5] = (uint16_t)((int16_t)(self->period_tick - cmprVal[5]));
            break;

