Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/MCTRL/src/Ifx_MAS_Modulator_F16.c
        case 2:
            self->p_output.compareValues_tick[1] = (uint16_t)cmprVal[0];
            self->p_output.compareValues_tick[2] = (uint16_t)cmprVal[1];
            self->p_output.compareValues_tick[0] = (uint16_t)cmprVal[2];
            self->p_output.compareValues_tick[4] = (uint16_t)((int16_t)(self->period_tick - cmprVal[3]));
            self->p_output.compareValues_tick[5] = (uint16_t)((int16_t)(self->period_tick - cmprVal[4]));
            self->p_output.compareValues_tick[3] = (uint16_t)((int16_t)(self->period_tick - cmprVal[5]));
            break;

        case 3:
            self->p_output.compareValues_tick[2] = (uint16_t)cmprVal[0];
            self->p_output.compareValues_tick[1] = (uint16_t)cmprVal[1];
            self->p_output.compareValues_tick[0] = (uint16_t)cmprVal[2];
            self->p_output.compareValues_tick[5] = (uint16_t)((int16_t)(self->period_tick - cmprVal[3]));
            self->p_output.compareValues_tick[4] = (uint16_t)((int16_t)(self->period_tick - cmprVal[4]));
            self->p_output.compareValues_tick[3] = (uint16_t)((int16_t)(self->period_tick - cmprVal[5]));
            break;

        case 4:
            self->p_output.compareValues_tick[2] = (uint16_t)cmprVal[0];
            self->p_output.compareValues_tick[0] = (uint16_t)cmprVal[1];
            self->p_output.compareValues_tick[1] = (uint16_t)cmprVal[2];
            self->p_output.compareValues_tick[5] = (uint16_t)((int16_t)(self->period_tick - cmprVal[3]));
            self->p_output.compareValues_tick[3] = (uint16_t)((int16_t)(self->period_tick - cmprVal[4]));
            self->p_output.compareValues_tick[4] = (uint16_t)((int16_t)(self->period_tick - cmprVal[5]));
            break;

        default:
            self->p_output.compareValues_tick[0] = (uint16_t)cmprVal[0];
            self->p_output.compareValues_tick[2] = (uint16_t)cmprVal[1];
            self->p_output.compareValues_tick[1] = (uint16_t)cmprVal[2];
            self->p_output.compareValues_tick[3] = (uint16_t)((int16_t)(self->period_tick - cmprVal[3]));
            self->p_output.compareValues_tick[5] = (uint16_t)((int16_t)(self->period_tick - cmprVal[4]));
            self->p_output.compareValues_tick[4] = (uint16_t)((int16_t)(self->period_tick - cmprVal[5]));
            break;
    }
}


#if IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK != 0
static inline uint8_t Ifx_MAS_Modulator_F16_checkMinOnTime(Ifx_MAS_Modulator_F16* self, int16_t* cmprVal)
{
    /* Unsigned integer is used instead of bool to improve performance */
    uint8_t isSevenSegment;

    /* Calculate the half of the minimum pulse length */
    int16_t halfMinimumPulseLength = (self->period_tick / 2) - cmprVal[2];

    /* Calculate switching time tLeft */
    int16_t tLeft = cmprVal[2] - cmprVal[1];

    /* Check if short pulse is smaller than the minimum turn on time and middle pulse is large enough for current
     * measurement */
    if ((halfMinimumPulseLength < self->p_minTurnOnTimeHalf_tick)
        && (tLeft > self->p_minSenseTime_tick / 2))
    {
        /* Compensate other phases */
        cmprVal[0] += halfMinimumPulseLength;
        cmprVal[1] += halfMinimumPulseLength;
        cmprVal[2] += halfMinimumPulseLength;

        /* After pulse elimination modulator is in 5 segment */
        isSevenSegment = 0u;
    }
    else
    {
        /* No elimination */
        isSevenSegment = 1u;
    }

    return isSevenSegment;
}


#endif /* IFX_MAS_MODULATOR_F16_CFG_MIN_ON_TIME_TICK */
